In [2]:
import pandas as pd

In [2]:
s = pd.Series([10,20,30,40,50])
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
s.dtype

dtype('int64')

In [4]:
s.values

array([10, 20, 30, 40, 50], dtype=int64)

In [5]:
s[0]

10

In [6]:
s.name = "Calories"

In [7]:
s

0    10
1    20
2    30
3    40
4    50
Name: Calories, dtype: int64

In [8]:
print(s.name)

Calories

In [9]:
s.iloc[3]

40

In [10]:
index = ["apple", "banana", "mango", "grapes", "kiwi"]
s.index = index
s

apple     10
banana    20
mango     30
grapes    40
kiwi      50
Name: Calories, dtype: int64

In [11]:
s.loc['apple']

10

In [12]:
s.loc['banana':'kiwi']

banana    20
mango     30
grapes    40
kiwi      50
Name: Calories, dtype: int64

In [13]:
s['mango'] = 60

In [14]:
s

apple     10
banana    20
mango     60
grapes    40
kiwi      50
Name: Calories, dtype: int64

In [4]:
import numpy as np

In [17]:
sr = pd.Series(['a',np.nan,1,np.nan,2])
sr.notnull().sum()

3

In [5]:
#Data FRame
data = {
    "Name" : ["Alice","Bob","Charlie","David","Eve","Alice"],
    "Age" : [25,30,35,np.nan,29,25],
    "Department" : ["HR", "IT","Finance", "IT","HR","HR"],
    "Salary" : [50000,60000,70000,62000,np.nan,50000]
}

In [6]:
data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Alice'],
 'Age': [25, 30, 35, nan, 29, 25],
 'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'HR'],
 'Salary': [50000, 60000, 70000, 62000, nan, 50000]}

In [7]:
df = pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [8]:
df.head()

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN

In [24]:
df.head(3)

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0

In [25]:
df.tail(3)

    Name   Age Department   Salary
3  David   NaN         IT  62000.0
4    Eve  29.0         HR      NaN
5  Alice  25.0         HR  50000.0

In [26]:
df.iloc[2:4]

      Name   Age Department   Salary
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0

In [27]:
df.loc[2:4]

      Name   Age Department   Salary
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN

In [29]:
df.loc[2:4,["Age","Department"]]

    Age Department
2  35.0    Finance
3   NaN         IT
4  29.0         HR

In [30]:
df["Age"]

0    25.0
1    30.0
2    35.0
3     NaN
4    29.0
5    25.0
Name: Age, dtype: float64

In [31]:
df[["Age", "Department"]]

    Age Department
0  25.0         HR
1  30.0         IT
2  35.0    Finance
3   NaN         IT
4  29.0         HR
5  25.0         HR

In [33]:
df.shape

(6, 4)

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         5 non-null      float64
 2   Department  6 non-null      object
 3   Salary      5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

In [35]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000

In [9]:
df["Salary"] = df["Salary"] + 5000
df["Salary"]

0    55000.0
1    65000.0
2    75000.0
3    67000.0
4        NaN
5    55000.0
Name: Salary, dtype: float64

In [10]:
df.rename(columns = {"Department" : "Dept"}, inplace = True)

In [11]:
df

      Name   Age     Dept   Salary
0    Alice  25.0       HR  55000.0
1      Bob  30.0       IT  65000.0
2  Charlie  35.0  Finance  75000.0
3    David   NaN       IT  67000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  55000.0

In [39]:
df["Dept"].unique()

array(['HR', 'IT', 'Finance'], dtype=object)

In [40]:
df["Dept"].value_counts()

Dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [12]:
df["Promoted Salary"] = df["Salary"] * 10

In [13]:
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

In [14]:
df.isnull()

    Name    Age   Dept  Salary  Promoted Salary
0  False  False  False   False            False
1  False  False  False   False            False
2  False  False  False   False            False
3  False   True  False   False            False
4  False  False  False    True             True
5  False  False  False   False            False

In [45]:
df.isnull().sum()

Name               0
Age                1
Dept               0
Salary             1
Promoted Salary    1
dtype: int64

In [46]:
df.dropna()

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
5    Alice  25.0       HR  55000.0         550000.0

In [47]:
df["Age"].fillna(df["Age"].mean())

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [48]:
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

In [49]:
df["Name"].replace("Charlie","Rose")

0    Alice
1      Bob
2     Rose
3    David
4      Eve
5    Alice
Name: Name, dtype: object

In [50]:
df["Name"]=df["Name"].replace("Charlie","Rose")

In [51]:
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0         750000.0
3  David   NaN       IT  67000.0         670000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  55000.0         550000.0

In [52]:
df_dup = df[df.duplicated()]
df_dup

    Name   Age Dept   Salary  Promoted Salary
5  Alice  25.0   HR  55000.0         550000.0

In [53]:
#Jions and Merges
department_info = {
    "Dpartment" : ["HR", "IT", "Finance"],
    "Location" : ["Newoyork", "UK", "London"],
    "Manager" : ["Laura", "Steve", "Nina"]
}

In [54]:
df2 = pd.DataFrame(department_info)

In [55]:
df2

  Dpartment  Location Manager
0        HR  Newoyork   Laura
1        IT        UK   Steve
2   Finance    London    Nina

In [56]:
 pd.concat([df, df2])

    Name   Age     Dept   Salary  Promoted Salary Dpartment  Location Manager
0  Alice  25.0       HR  55000.0         550000.0       NaN       NaN     NaN
1    Bob  30.0       IT  65000.0         650000.0       NaN       NaN     NaN
2   Rose  35.0  Finance  75000.0         750000.0       NaN       NaN     NaN
3  David   NaN       IT  67000.0         670000.0       NaN       NaN     NaN
4    Eve  29.0       HR      NaN              NaN       NaN       NaN     NaN
5  Alice  25.0       HR  55000.0         550000.0       NaN       NaN     NaN
0    NaN   NaN      NaN      NaN              NaN        HR  Newoyork   Laura
1    NaN   NaN      NaN      NaN              NaN        IT        UK   Steve
2    NaN   NaN      NaN      NaN              NaN   Finance    London    Nina

In [1]:
import pandas as pd

In [2]:
from faker import Faker

In [3]:
fake = Faker()
data = []
for _ in range(200):
    data.append({
        'name' : fake.name(),
        'email' : fake.email(),
        'age' : fake.random_int(min = 18, max = 60),
        'city' : fake.city()
    })
df = pd.DataFrame(data)

In [8]:
df.to_csv("Dummy_data.csv", index = False)

In [9]:
data_csv = pd.read_csv("Dummy_data.csv")

In [10]:
data_csv.head()

                name                       email  age               city
0  Ronald Richardson        gfarrell@example.org   45   South Meganshire
1      Theresa Adams          cwolfe@example.org   35  East Reneeborough
2       Emily Knight       michele41@example.net   48       Carolinefurt
3       Steve Hudson    deborahjones@example.org   32          Brianberg
4       Daniel Walls  thomasbrittany@example.com   52    New Tamaraville

In [11]:
data_csv.tail(3)

                name                      email  age            city
197   William Jordan      pattontom@example.com   44     West Robert
198  Stacey Davidson    jamesstokes@example.com   35        Emmaview
199     Eric Barrera  pattersongail@example.org   48  West Christina

In [12]:
df.isnull().sum()

name     0
email    0
age      0
city     0
dtype: int64

In [13]:
df.shape

(200, 4)

In [14]:
df.loc[100:200]

                   name                      email  age              city
100          Brian Ford         qyoung@example.com   50        Torrestown
101        Matthew West         mdavis@example.com   20    Stephaniemouth
102     Brandon Goodman        jenna18@example.net   36      Sarahchester
103      Becky Peterson  ronaldherrera@example.com   30     North Heather
104         Lori Cooley       arthur88@example.org   24   Port Evelynport
..                  ...                        ...  ...               ...
195          Sheri Chan          fbray@example.com   41        Farmerberg
196  Jeffrey Foster PhD   glovertravis@example.com   38  New Scottborough
197      William Jordan      pattontom@example.com   44       West Robert
198     Stacey Davidson    jamesstokes@example.com   35          Emmaview
199        Eric Barrera  pattersongail@example.org   48    West Christina

[100 rows x 4 columns]

In [15]:
df.drop('city', axis = 1)

                   name                       email  age
0     Ronald Richardson        gfarrell@example.org   45
1         Theresa Adams          cwolfe@example.org   35
2          Emily Knight       michele41@example.net   48
3          Steve Hudson    deborahjones@example.org   32
4          Daniel Walls  thomasbrittany@example.com   52
..                  ...                         ...  ...
195          Sheri Chan           fbray@example.com   41
196  Jeffrey Foster PhD    glovertravis@example.com   38
197      William Jordan       pattontom@example.com   44
198     Stacey Davidson     jamesstokes@example.com   35
199        Eric Barrera   pattersongail@example.org   48

[200 rows x 3 columns]

In [16]:
df.describe()

             age
count  200.00000
mean    40.04500
std     12.10187
min     18.00000
25%     30.75000
50%     40.00000
75%     50.00000
max     60.00000